import React from 'react';

const QusnAndAns = () => {
    return (
        <div className='mt-5'>
            <h3>১) কিভাবে রিয়েক্ট কাজ করে ?</h3>
            <p>রিয়েক্ট সর্বদাই একমুখী ডেটা প্রবাহ করে থাকে। তার মানে, যখন একটি রিয়েক্ট অ্যাপ ডিজাইন করা হয়, তখন প্যারেন্ট ও চাইল্ড কম্পোনেন্টের মধ্যে কানেকশন তৈরী করতে হয়। এতে করে খুব সহজে বিভিন্ন ইরর ডিবাগ করা যায়। ও কোনো বাগ পাওয়া গেলে সেটা দ্রুত ফিক্স করা সম্ভব হয়। রিঅ্যাক্ট সাধারণত ইউজার ইন্টারফেস বানাতে ইউজ করা হয়। সহজেই ইউজার ইন্টারফেজ বানানো, পেজে যেকোনো ধরনের পরিবর্তন সহজেই, কম সময়ের মধ্যে করানো, ডাটা একজায়গা থেকে আরেকজায়গায় ফ্লো করানো । </p>

            <h3 className='mt-3'> ২)useState কিভাবে কাজ করে ?</h3>
            <p>useState হল একটি হুক যা আপনাকে কার্যকরী উপাদানগুলিতে স্টেট ভেরিয়েবল রাখতে দেয়। আপনি এই ফাংশনে প্রারম্ভিক অবস্থা পাস করেন এবং এটি বর্তমান অবস্থার মান (প্রাথমিক অবস্থা নয়) এবং এই মান আপডেট করার জন্য অন্য একটি ফাংশন সহ একটি ভেরিয়েবল প্রদান করে।</p>
        </div>
    );
};

export default QusnAndAns;